{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float64", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "encoder_h1", "class_name": "Dense", "config": {"name": "encoder_h1", "trainable": true, "dtype": "float64", "units": 100, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "encoder_h2", "class_name": "Dense", "config": {"name": "encoder_h2", "trainable": true, "dtype": "float64", "units": 100, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoder_h1", 0, 0, {}]]]}, {"name": "encoder_out", "class_name": "Dense", "config": {"name": "encoder_out", "trainable": true, "dtype": "float64", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoder_h2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["encoder_out", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}